module.exports = [
  // Project Paryi
  { mid: 1576121, note: 'Paryi' },
  { mid: 372984197, note: 'Shiori' },
  { mid: 349991143, note: 'Mea' },
  { mid: 8119834, note: 'Hana' },
  { mid: 2778044, note: 'Miu' },
  { mid: 3149619, note: 'mana' },
  { mid: 6055289, note: 'YYUT(x)' },
  { mid: 380829248, note: '救救猫猫' },
  { mid: 1869304, note: 'ENA' },

  // Chukolala
  { mid: 406805563, note: 'Oto' },
  { mid: 3568142, note: '果冻妹' },
  { mid: 407067880, note: '伞' },
  { mid: 1498668, note: 'Chisuzu' },
  { mid: 2299184, note: 'Komori' },
  { mid: 1429475, note: 'Chiaki' },

  // Homolive
  { mid: 12362451, note: 'homolive' },
  { mid: 405981431, note: 'snow' },
  { mid: 348832436, note: '兔鞠Mari' },

  // Hololive
  { mid: 286700005, note: 'hololive' },

  { mid: 286179206, note: 'Sora' },
  { mid: 20813493, note: 'roboko' },
  { mid: 366690056, note: 'Miko' },

  { mid: 389856447, note: 'MEL' },
  { mid: 389857131, note: 'Aki' },
  { mid: 339567211, note: 'heart' },
  { mid: 332704117, note: 'Fubuki' },
  { mid: 336731767, note: 'xia' },

  { mid: 375504219, note: 'Aqua' },
  { mid: 389857640, note: 'Shion' },
  { mid: 389858027, note: 'Oni' },
  { mid: 389858754, note: 'Choko' },
  { mid: 389859190, note: 'Subaru' },

  { mid: 389862071, note: 'Mio' },
  { mid: 412135222, note: 'Okayu' },
  { mid: 412135619, note: 'Korone' },

  // Upd8

  // 爱酱
  { mid: 1473830, note: 'KIZUNA.AI' },
  // { mid: 27534330, note: '爱酱' },
  { mid: 325325965, note: 'YuNi' },
  { mid: 90100786, note: '青家大院AVtuber' },
  { mid: 80387576, note: 'Hime' },
  { mid: 15095071, note: 'Kerin爆破搬运组' },
  { mid: 5847902, note: 'Omega姐妹' },

  // ENTUM
  { mid: 238537745, note: '未来明' },
  { mid: 291296062, note: '猫宫' },
  { mid: 20709396, note: '饼' },
  { mid: 395814787, note: '皆守ひいろ' },

  // oveRidea
  { mid: 18149131, note: '🔨' },

  // 艾琳
  { mid: 292044559, note: 'Yomemi' },
  { mid: 355167926, note: 'Englisher' },

  // sora4
  { mid: 5570898, note: '白音小雪' },

  // Winks
  { mid: 337827661, note: '陆婉莹' },

  { mid: 359080356, note: '惺忪喵' },
  { mid: 359081808, note: '季毅' },
  { mid: 359081307, note: '花音' },
  { mid: 359082339, note: 'Pro' },
  { mid: 359082596, note: '于川流丹' },
  { mid: 339116260, note: 'WINKS字幕搬运' },

  // 上面阿修的gachi
  { mid: 10829693, note: 'GachiA' },
  { mid: 12964678, note: 'GachiH' },

  { mid: 387108043, note: '莉姬' },
  { mid: 1826804, note: '爱夏' },
  { mid: 387236794, note: '初颜' },
  { mid: 387091887, note: '奈子' },
  { mid: 387113126, note: '音仙吕' },
  // Winks Extra
  { mid: 536899, note: '钟老师' },
  { mid: 353044891, note: 'Adam' },
  { mid: 204838732, note: '鬼月' },
  { mid: 381294255, note: 'WINKS事务所' },

  // KMNHZ
  { mid: 2149710, note: 'KMNHZ' },
  { mid: 397520517, note: 'LIZ' },
  { mid: 397520048, note: 'LITA' },

  // Office339
  { mid: 267970450, note: 'DD' },
  { mid: 382821371, note: 'JJ' },
  { mid: 24622055, note: 'GG' },

  // Unlimited
  { mid: 252599, note: '游戏部' },
  { mid: 381951501, note: 'Cocoa' },

  // 彩虹社2434
  { mid: 403927583, note: '椎名唯华' },
  { mid: 403930401, note: '绿仙' },
  { mid: 403928672, note: '葵' },
  { mid: 403921378, note: '凛' },
  { mid: 410484677, note: '彩虹社官方' },
  // 非官方(?)
  { mid: 109891, note: '月ノ美兎' },
  { mid: 344515485, note: '樋口枫' },
  { mid: 1552664, note: '鈴谷アキ字幕组' },
  { mid: 28300270, note: 'moira搬运组' },
  { mid: 3726678, note: '鬼畜千寻炎哈组' },
  { mid: 327875807, note: '剑持刀也搬运组' },
  { mid: 401166457, note: '伏見ガク搬运组' },
  { mid: 2230818, note: '夕阳莉莉搬运組' },
  { mid: 3326614, note: '野猫航空搬运组' },
  { mid: 351599084, note: '铃鹿诗子字幕组' },
  { mid: 18838062, note: '森中花咲' },
  { mid: 399817053, note: '出雲霞' },
  { mid: 362420674, note: '修女克蕾雅' },
  { mid: 414127280, note: '社筑' },
  { mid: 20313142, note: '雨森小夜搬运组' },
  { mid: 5595729, note: '舞元启介' },
  { mid: 19959581, note: '町田ちま' },
  { mid: 1818100, note: '黑井柴的犬舍后院' },
  { mid: 385501313, note: '叶＆葛葉双人' },
  { mid: 315102133, note: '赤羽叶子' },
  { mid: 384064360, note: '竜胆尊' },
  { mid: 257492, note: '久远千岁' },
  { mid: 230947255, note: '笹木咲' },
  { mid: 406532904, note: '御伽原江良' },
  { mid: 4903038, note: '戌亥 とこ' },
  { mid: 4504727, note: '三枝明那搬運組' },
  { mid: 323590528, note: '静凛字幕组' },
  { mid: 328021285, note: 'mugi字幕组' },
  { mid: 152257800, note: '精灵Elu/妖精艾露' },

  // 上海2434
  { mid: 1631724, note: '塞塔nya' },

  // Redstar
  // TODO: alias account
  // TODO: 397047629
  { mid: 444559, note: 'Redstar' },

  // THE MOON STUDIO
  { mid: 265224956, note: 'Luna' },
  { mid: 393940396, note: '巨乳可能' },

  // Lucca Project
  { mid: 610390, note: '乌拉' },
  { mid: 36690170, note: '秋明' },
  { mid: 403894805, note: '柯里克' },

  // SOW
  { mid: 408231448, note: 'Misa' },
  { mid: 405037911, note: '莲娜' },
  { mid: 82803440, note: '凛星' },
  { mid: 166617, note: 'Ita' },

  { mid: 403080854, note: 'Nia' },
  { mid: 1337624, note: '奈木' },
  { mid: 186463, note: 'NaNa' },
  { mid: 402105315, note: 'Miya' },
  { mid: 3287291, note: 'Riztech' },
  { mid: 315830968, note: '眠葉紺' },
  { mid: 10369514, note: 'Erika' },
  { mid: 934940, note: 'Paramecium' },
  { mid: 61639371, note: 'Joi' },
  { mid: 147471, note: 'YY' },
  { mid: 2483446, note: '你也是最弱' },

  // HoderAstra
  { mid: 281426315, note: '矢泽大凤' },
  { mid: 18699270, note: '金丝蓝染' },
  { mid: 1802067, note: 'Plutya' },

  // Chucolala
  { mid: 401480763, note: '真白花音' },
  { mid: 407106379, note: 'erio' },

  // HoneyStrap
  { mid: 385851175, note: '周防パトラ' },
  { mid: 389349320, note: '蒼月エリ' },
  { mid: 400323299, note: '島村シャルロット' },
  { mid: 2073698, note: '西園寺メアリ' },
  { mid: 389647363, note: '堰代ミコ' },

  // Animare 有閑喫茶あにまーれ
  { mid: 382545233, note: '因幡組' },
  { mid: 4175516, note: '宇森ひなこ' },
  { mid: 809154, note: '宗谷いちか' },
  { mid: 390899490, note: '日ノ隈らん' },

  { mid: 45921503, note: 'AnMr海外转播' },

  // 虚研社
  { mid: 4763529, note: '幽灵子辰' },

  // VOMNIS
  { mid: 464865, note: '小卯' },
  { mid: 1910639, note: '染谷杏' },
  { mid: 10207746, note: '鶹鸝' },
  { mid: 49694204, note: '转圈' },

  // CodeEcho
  { mid: 416203727, note: '铃果' },

  // Kenlos
  { mid: 1421667, note: '丹羽加奈' },
  { mid: 13096224, note: '恒天' },
  { mid: 7287911, note: '胧玥' },

  { mid: 13791309, note: '早见樱' },
  { mid: 1836495, note: '喵奈子' },

  // Gemscompany
  { mid: 355810003, note: '水科葵' },
  { mid: 318581967, note: '珠根うた' },

  // .LIVE
  { mid: 391876799, note: 'siro' },
  { mid: 11725160, note: '路人豆腐铺' }, // siro的搬运账号
  { mid: 409689786, note: '马叔' },
  { mid: 349674525, note: '毛绒田咩咩咩' },
  { mid: 5174606, note: '北上双叶' },
  { mid: 454530, note: '花京院ちえり' },

  // 无所属/无细分 (懒)
  { mid: 386900246, note: '鬼妈' },
  { mid: 3772162, note: '清露' },
  { mid: 364225566, note: '战斗吧歌姬' },
  { mid: 1612112, note: '魔宵' },
  { mid: 203365648, note: 'Alice' },
  { mid: 35749736, note: '子彧' },
  { mid: 125823832, note: '琥珀-虚颜' },
  { mid: 31761638, note: '8911勘测研究所' },
  { mid: 5563350, note: '虚拟次元计划' },
  { mid: 327711614, note: '出本有望' },
  { mid: 388693909, note: 'Mendako醤Official' },
  { mid: 397723865, note: '竹轮喵Official' },
  { mid: 483231, note: '乐喵Channel' },
  { mid: 392505232, note: '安堂いなり_official' },
  { mid: 391760485, note: '柚唧の微光小剧场' },
  { mid: 17492464, note: '心斎桥オクトOfficial' },
  { mid: 205059, note: '李稍牙牙語' },
  { mid: 358695457, note: 'Siva_小虾鱼_' },
  { mid: 373493702, note: 're' },
  { mid: 374017536, note: '女巫Vivian' },
  { mid: 308751411, note: '東雲恵Official' },
  { mid: 377899842, note: '纸木姐妹' },
  { mid: 20530305, note: '木糖纯和庄不纯' },
  { mid: 389052754, note: '摩提_MoChi' },
  { mid: 397222615, note: '蒼乃幽姬' },
  { mid: 403768239, note: 'RukiRokiChannel' },
  { mid: 320740464, note: '兰若_Ruo' },
  { mid: 345819190, note: 'Kanna' },
  { mid: 296909317, note: 'himehina' },
  { mid: 391875813, note: '白组' },
  { mid: 2304086, note: '可能是VTB里技术最好的' },
  { mid: 9824984, note: 'Nachoco' },
  { mid: 360221708, note: '天神子兔音' },
  { mid: 389056211, note: 'AZKi' },
  { mid: 420321371, note: '涉谷HAL' },
  { mid: 406548031, note: '音俣るか' },
  { mid: 198297, note: '进击的冰糖' },
  { mid: 492862, note: '阳向心美' },
  { mid: 423747660, note: '成早酱' },
  { mid: 410236949, note: '雪城真寻' },
  { mid: 407806618, note: '冻砂与海桑' },
  { mid: 406474271, note: '庞小莹' },
  { mid: 49464709, note: 'Leia' },
  { mid: 19462294, note: 'Lemonsix' },
  { mid: 2461100, note: '艾莓雅' },
  { mid: 175056, note: 'yakko' },
  { mid: 410741448, note: 'Milky' },
  { mid: 11063770, note: '大猩猩' },
  { mid: 408447874, note: '花譜的音乐' },
  { mid: 39106621, note: 'DWU' },
  { mid: 26155426, note: '二宫和也/梦璃' },
  { mid: 9375210, note: '白咲铃' },
  { mid: 414840678, note: '青木ルア' },
  { mid: 283053549, note: '雪乃世界' },
  { mid: 406117158, note: '御伽莉鹿' },
  { mid: 395933021, note: '名取sana' },
  { mid: 402176802, note: '高峰伊织' },
  { mid: 397633547, note: '泡沫小毬' },
  { mid: 398764283, note: '佐藤ココ' },
  { mid: 32166778, note: '花町猫耳' },
  { mid: 12920215, note: '真白くま' },
  { mid: 390131950, note: '水无濑' },
  { mid: 417507910, note: '狛犬' },
  { mid: 508191, note: 'Azulim' },
  { mid: 398642121, note: '千条アリア' },
  { mid: 331249454, note: '璃露' },
  { mid: 6777056, note: '朝之姐妹' },
  { mid: 415858231, note: '佐久間ねむ' },
  { mid: 365308305, note: '夜桜たま' },
  { mid: 3499787, note: 'AYAYA白組搬运工' },
  { mid: 16706112, note: '郡道美玲&夢月ロア' },
  { mid: 399574079, note: '闇夜乃莫露露' },
  { mid: 3584186, note: '狐狐音' },
  { mid: 394851149, note: 'Eve_aic' },
  { mid: 406748610, note: 'MEMProject' },
  { mid: 371691012, note: 'Alt_Vtuber' },
  { mid: 544348, note: '青铜高校游戏部' },
  { mid: 55300691, note: 'Vtuber作家艾尔酱' },
  { mid: 236022662, note: '鸣神裁' },
  { mid: 102600, note: '星宫Htaku' },
  { mid: 33398732, note: '三田sonia' },
  { mid: 390186116, note: '屍鬼' },
  { mid: 7078836, note: '富士葵' },
  { mid: 421347849, note: '白百合' },
  { mid: 24791744, note: '杀戮的天使官方' },
  { mid: 298077390, note: 'KanataHikari搬运' },
  { mid: 6826308, note: '千代家ぷりり搬运' },
  { mid: 354142359, note: '狸猫花生搬运组' },
  { mid: 396532028, note: '童田明治的小狼窝' },
  { mid: 15936956, note: '穿裙带菜裸奔人字幕组' },

  // 从直播区抓过来的
  { mid: 7858535, note: '豆腐' },
  { mid: 391614061, note: 'Hizuki Miu' },
  { mid: 264319276, note: '花芽姐妹' },
  { mid: 5421881, note: 'Asaha' },
  { mid: 399554022, note: '竹取かるた' },
  { mid: 328576435, note: '星空悠' },
  { mid: 136844, note: 'RiNE' },
  { mid: 1448323, note: '樱美Yuna' },
  { mid: 412113528, note: '风月莉莉娅' },
  { mid: 20600085, note: '静夜夜' },
  { mid: 846180, note: 'Miya' },
  { mid: 2023004, note: 'MEYO' },
  { mid: 245093784, note: 'Lily' },
  { mid: 620903, note: '泰蕾莎' },
  { mid: 345648420, note: 'Okome' },
  { mid: 176486647, note: '银河爱丽丝' },
  { mid: 5730, note: '星乃めあ' },
  { mid: 394918929, note: 'ウタゴエ' },
  { mid: 3608875, note: '魔王城ch' },

  // 快看快看是Menhera
  { mid: 326968804, note: 'Menhera' },

  // 「你也是VTB了」大赏
  { mid: 12895828, note: '莫叁' },
]
